rssdd-steady-state.log
sequential-fill: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=16
random-write-steady: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=2): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 9 processes

sequential-fill: (groupid=0, jobs=1): err= 0: pid=23540: Fri Jul 28 09:29:06 2017
  Description  : [Sequential fill phase]
  write: io=333861MB, bw=1216.5MB/s, iops=1216, runt=274464msec
    slat (usec): min=37, max=1597, avg=96.09, stdev=30.83
    clat (msec): min=1, max=115, avg=13.06, stdev= 4.54
     lat (msec): min=1, max=115, avg=13.15, stdev= 4.54
    clat percentiles (msec):
     |  1.00th=[   13],  5.00th=[   13], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   13], 40.00th=[   13], 50.00th=[   13], 60.00th=[   13],
     | 70.00th=[   13], 80.00th=[   13], 90.00th=[   13], 95.00th=[   13],
     | 99.00th=[   14], 99.50th=[   15], 99.90th=[  102], 99.95th=[  105],
     | 99.99th=[  114]
    bw (MB  /s): min=  772, max= 1242, per=100.00%, avg=1218.15, stdev=88.96
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=99.73%, 50=0.01%
    lat (msec) : 100=0.09%, 250=0.17%
  cpu          : usr=2.48%, sys=9.82%, ctx=333846, majf=0, minf=2695
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=333861/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16
random-write-steady: (groupid=1, jobs=4): err= 0: pid=24181: Fri Jul 28 09:29:06 2017
  Description  : [Random write steady state phase]
  write: io=1304.2GB, bw=582844KB/s, iops=145710, runt=2346247msec
    slat (usec): min=1, max=1047, avg= 5.02, stdev= 4.12
    clat (usec): min=258, max=103854, avg=864.00, stdev=1334.76
     lat (usec): min=276, max=103857, avg=869.15, stdev=1334.73
    clat percentiles (usec):
     |  1.00th=[  410],  5.00th=[  442], 10.00th=[  486], 20.00th=[  564],
     | 30.00th=[  644], 40.00th=[  724], 50.00th=[  796], 60.00th=[  876],
     | 70.00th=[  964], 80.00th=[ 1080], 90.00th=[ 1272], 95.00th=[ 1432],
     | 99.00th=[ 1864], 99.50th=[ 2064], 99.90th=[ 2608], 99.95th=[ 2992],
     | 99.99th=[100864]
    bw (KB  /s): min=56975, max=305896, per=25.24%, avg=147089.41, stdev=32461.45
    lat (usec) : 500=11.60%, 750=32.14%, 1000=29.37%
    lat (msec) : 2=26.29%, 4=0.58%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.02%
  cpu          : usr=9.80%, sys=21.19%, ctx=167774820, majf=0, minf=47931
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=341873784/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=2, jobs=4): err= 0: pid=28225: Fri Jul 28 09:29:06 2017
  Description  : [Random read steady state phase]
  read : io=1304.2GB, bw=1239.3MB/s, iops=317250, runt=1077615msec
    slat (usec): min=1, max=633, avg= 4.50, stdev= 9.31
    clat (usec): min=44, max=102798, avg=309.18, stdev=810.49
     lat (usec): min=64, max=102800, avg=313.81, stdev=811.51
    clat percentiles (usec):
     |  1.00th=[  120],  5.00th=[  141], 10.00th=[  157], 20.00th=[  179],
     | 30.00th=[  201], 40.00th=[  223], 50.00th=[  245], 60.00th=[  266],
     | 70.00th=[  294], 80.00th=[  338], 90.00th=[  524], 95.00th=[  836],
     | 99.00th=[ 1096], 99.50th=[ 1176], 99.90th=[ 1416], 99.95th=[ 1592],
     | 99.99th=[ 2288]
    bw (KB  /s): min=83417, max=759592, per=32.04%, avg=406579.65, stdev=177536.84
    lat (usec) : 50=0.01%, 100=0.16%, 250=52.06%, 500=37.33%, 750=3.82%
    lat (usec) : 1000=4.62%
    lat (msec) : 2=1.99%, 4=0.01%, 10=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.01%
  cpu          : usr=19.03%, sys=50.70%, ctx=25932007, majf=0, minf=41338
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=341873784/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=333861MB, aggrb=1216.5MB/s, minb=1216.5MB/s, maxb=1216.5MB/s, mint=274464msec, maxt=274464msec

Run status group 1 (all jobs):
  WRITE: io=1304.2GB, aggrb=582843KB/s, minb=582843KB/s, maxb=582843KB/s, mint=2346247msec, maxt=2346247msec

Run status group 2 (all jobs):
   READ: io=1304.2GB, aggrb=1239.3MB/s, minb=1239.3MB/s, maxb=1239.3MB/s, mint=1077615msec, maxt=1077615msec

Disk stats (read/write):
  rssdd: ios=341861731/342541506, merge=0/0, ticks=81905865/301588068, in_queue=393285319, util=100.00%