rssdd-steady-state_2.log
random-write-steady: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
random-read-steady: (g=1): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.2.8
Starting 64 processes

random-write-steady: (groupid=0, jobs=32): err= 0: pid=38241: Sun Jul 30 08:53:30 2017
  Description  : [Random write steady state phase]
  write: io=31299GB, bw=537087KB/s, iops=134271, runt=61107196msec
    slat (usec): min=1, max=111753, avg=235.64, stdev=725.22
    clat (usec): min=278, max=135646, avg=7382.68, stdev=4272.44
     lat (usec): min=282, max=136865, avg=7618.67, stdev=4352.18
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    7], 40.00th=[    7], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    9], 80.00th=[    9], 90.00th=[   10], 95.00th=[   11],
     | 99.00th=[   14], 99.50th=[   16], 99.90th=[  106], 99.95th=[  109],
     | 99.99th=[  111]
    bw (KB  /s): min= 9023, max=311504, per=3.13%, avg=16812.84, stdev=1596.36
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.03%, 4=2.35%, 10=36.62%, 20=8.45%, 50=0.06%
    lat (msec) : 100=0.01%, 250=0.14%
  cpu          : usr=1.24%, sys=3.58%, ctx=6955991480, majf=0, minf=1202975
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=47.7%, >=64=0.0%
     submit    : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=47.7%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=8204970816/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
random-read-steady: (groupid=1, jobs=32): err= 0: pid=12954: Sun Jul 30 08:53:30 2017
  Description  : [Random read steady state phase]
  read : io=10433GB, bw=1545.1MB/s, iops=395745, runt=6910980msec
    slat (usec): min=1, max=202144, avg=78.33, stdev=417.66
    clat (usec): min=62, max=208945, avg=2503.78, stdev=2354.28
     lat (usec): min=72, max=208948, avg=2582.40, stdev=2395.66
    clat percentiles (usec):
     |  1.00th=[ 1240],  5.00th=[ 1544], 10.00th=[ 1720], 20.00th=[ 1944],
     | 30.00th=[ 2096], 40.00th=[ 2256], 50.00th=[ 2416], 60.00th=[ 2544],
     | 70.00th=[ 2704], 80.00th=[ 2928], 90.00th=[ 3248], 95.00th=[ 3536],
     | 99.00th=[ 4256], 99.50th=[ 4704], 99.90th=[ 6304], 99.95th=[ 9792],
     | 99.99th=[103936]
    bw (KB  /s): min=20424, max=708408, per=3.13%, avg=49573.64, stdev=5648.71
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.03%, 750=0.07%, 1000=0.18%
    lat (msec) : 2=22.41%, 4=75.64%, 10=1.62%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.05%
  cpu          : usr=3.18%, sys=9.19%, ctx=1556427258, majf=0, minf=455961
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=2734990272/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=31299GB, aggrb=537087KB/s, minb=537087KB/s, maxb=537087KB/s, mint=61107196msec, maxt=61107196msec

Run status group 1 (all jobs):
   READ: io=10433GB, aggrb=1545.1MB/s, minb=1545.1MB/s, maxb=1545.1MB/s, mint=6910980msec, maxt=6910980msec

Disk stats (read/write):
  rssdd: ios=2737999239/8204977031, merge=2669767/0, ticks=1719918193/2532157249, in_queue=462818179, util=100.00%